Web System Technologies/electriccompany/app/Models/CustomerAccountModel.php

SELECT *
FROM `customer_accounts`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
---
public function getAccountsPaginated($perPage = 10)
{
return $this->orderBy('created_at', 'DESC')->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
---
public function getTotalAccounts()
{
return $this->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
WHERE `status` = 'active'
---
public function getCountByStatus($status)
{
return $this->where('status', $status)->countAllResults();