Web System Technologies/electriccompany/app/Controllers/Home.php

UPDATE `customer_accounts` SET `account_number` = 'EC-2024-0001', `customer_name` = 'John Smith', `address` = '123 Main Street, Downtown', `phone` = '555-0101', `email` = 'john.smith@email.com', `meter_number` = 'MTR-001', `connection_type` = 'residential', `status` = 'inactive', `updated_at` = '2026-10-04 09:54:02'
WHERE `customer_accounts`.`id` IN ('1')
---
    public function updateAccount($id)
    {
        if (session()->get('isLogged') !== true) {
            return redirect()->to('/login');
        }

        if (!$this->customerModel->find($id)) {
            return redirect()->to('/dashboard')->with('error', 'Account not found.');
        }

        $rules = $this->accountRules();
        $rules['account_number'] .= '|is_unique[customer_accounts.account_number,id,' . (int) $id . ']';

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        if (!$this->customerModel->update($id, $this->accountData())) {