Web System Technologies/electriccompany/app/Controllers/Register.php

INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone`, `address`, `city`, `state`, `zip_code`, `password`, `user_type`, `is_active`, `email_verified`, `created_at`, `updated_at`) VALUES ('Tristan Sam', 'Carabbacan', 'tristansamc@gmail.com', '(917) 555-5192', '151 taggappan ', 'Echague', 'CO', '67676', '$2y$10$rilTAQMvow/30YEfI5YPOej5LHMIlSl6B9lrzz8rYUHcVKkduUyL2', 'customer', 1, 0, '2026-09-23 02:11:05', '2026-09-23 02:11:05')
---
        ];

        try {
            $userId = $this->userModel->insert($userData);